{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"batch_input_shape": [null, 4], "output_dim": 4, "input_dtype": "float32", "name": "dense_1", "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": 4, "trainable": true, "activation": "relu", "b_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 3, "input_dim": null, "trainable": true, "name": "dense_2", "W_constraint": null, "b_regularizer": null, "activation": "sigmoid", "b_constraint": null, "activity_regularizer": null, "W_regularizer": null}}]}