{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "input_dtype": "float32", "dim_ordering": "th", "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_row": 5, "nb_filter": 4, "name": "convolution2d_1", "init": "glorot_uniform", "border_mode": "valid", "subsample": [1, 1], "batch_input_shape": [null, 1, 28, 28], "activation": "linear", "nb_col": 5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "tanh"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "th", "name": "maxpooling2d_1", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"trainable": true, "dim_ordering": "th", "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "nb_row": 3, "nb_filter": 8, "name": "convolution2d_2", "init": "glorot_uniform", "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "activation": "linear", "nb_col": 3}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "tanh"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "dim_ordering": "th", "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "nb_row": 3, "nb_filter": 16, "name": "convolution2d_3", "init": "glorot_uniform", "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "activation": "linear", "nb_col": 3}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "tanh"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "th", "name": "maxpooling2d_2", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "input_dim": null, "name": "dense_1", "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 256, "b_constraint": null, "activity_regularizer": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "input_dim": null, "name": "dense_2", "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 10, "b_constraint": null, "activity_regularizer": null, "activation": "softmax"}}]}